In [1]:
import pandas as pd 
import numpy as np

In [3]:
DICT = {
    'A':[1,2,np.nan,4], 'B':[5,3,np.nan,9], 'C':[10,6,4,3], 'D':[np.nan, 8,np.nan,0]
}

In [4]:
df = pd.DataFrame(DICT)

In [5]:
df

     A    B   C    D
0  1.0  5.0  10  NaN
1  2.0  3.0   6  8.0
2  NaN  NaN   4  NaN
3  4.0  9.0   3  0.0

In [9]:
df.dropna() #dropping all NAN values

     A    B  C    D
1  2.0  3.0  6  8.0
3  4.0  9.0  3  0.0

In [10]:
df.dropna(axis=1) #dropping columns with NAN values

    C
0  10
1   6
2   4
3   3

In [14]:
## THRESH VALUES 
df

     A    B   C    D
0  1.0  5.0  10  NaN
1  2.0  3.0   6  8.0
2  NaN  NaN   4  NaN
3  4.0  9.0   3  0.0

In [19]:
df.dropna(thresh=2)

     A    B   C    D
0  1.0  5.0  10  NaN
1  2.0  3.0   6  8.0
3  4.0  9.0   3  0.0

# Fill NA

In [20]:
df.fillna(value="value missing")

               A              B   C              D
0            1.0            5.0  10  value missing
1            2.0            3.0   6            8.0
2  value missing  value missing   4  value missing
3            4.0            9.0   3            0.0

In [21]:
df

     A    B   C    D
0  1.0  5.0  10  NaN
1  2.0  3.0   6  8.0
2  NaN  NaN   4  NaN
3  4.0  9.0   3  0.0

In [29]:
# df["A"].fillna(value=df['A'].mean())
df['A'].fillna(value=df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
Name: A, dtype: float64

In [24]:
new_df = df[['A','B','C','D']].fillna(df[['A','B','C','D']].mean())
new_df  # new dataframe with missing values filled by the mean.

          A         B   C    D
0  1.000000  5.000000  10  4.0
1  2.000000  3.000000   6  8.0
2  2.333333  5.666667   4  4.0
3  4.000000  9.000000   3  0.0

## Groupby function

In [30]:
# syntax 

# df.groupby('column_name')

In [31]:
df.groupby('A')